1C-Medtech/1СМедтехника.днк/src/Documents/ПриходнаяНакладная/ПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПриходнаяНакладная</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВключатьРасходыВСебестоимость</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.ВидыОперацийПриходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗачетаПредоплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>EnumRef.СпособыЗачетаИРаспределенияПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>СерийныеНомера</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Себестоимость</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидкиНаценки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТоварыДляПроизводства</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Ячейки</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расходы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПоставщику</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DocumentRef.ЗаказПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидкиНаценки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидкиНаценки</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Предоплата</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Документ</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСертификата</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>CatalogRef.СерийныеНомера</types>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Курс</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кратность</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <objectBelonging>Adopted</objectBelonging>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьТоварыПоДаннымПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Document>

1C-Medtech/1СМедтехника.днк/src/Documents/ПриходнаяНакладная/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура днк_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Объект.ВключатьРасходыВСебестоимость Тогда 	
		днк_ДобавитьДнкКоэффициент();
		днк_ПересчитатьДнкКоэффициентСервер();
	КонецЕсли;
	Элементы.ЗапасыРасходыИтогВсего.Видимость = Объект.ВключатьРасходыВСебестоимость;
КонецПроцедуры

&НаКлиенте
Процедура днк_ВключатьРасходыВСебестоимостьПриИзмененииПосле(Элемент)
	Если Объект.ВключатьРасходыВСебестоимость Тогда
		днк_ДобавитьДнкКоэффициент();
		днк_ПересчитатьДнкКоэффициентСервер();
		днк_ПроверитьИтогДнкКоэффициент();
	Иначе
		днк_УдалитьДнкКоэффициент();
	КонецЕсли;
	Элементы.ЗапасыРасходыИтогВсего.Видимость = Объект.ВключатьРасходыВСебестоимость;
КонецПроцедуры

&НаКлиенте
Процедура днк_РасходыЦенаПриИзмененииПосле(Элемент)
	днк_ПересчитатьДнкКоэффициентСервер();
	днк_ПроверитьИтогДнкКоэффициент();
КонецПроцедуры

&НаКлиенте
Процедура днк_РасходыПослеУдаленияПосле(Элемент)
	днк_ПересчитатьДнкКоэффициентСервер();
	днк_ПроверитьИтогДнкКоэффициент();
КонецПроцедуры

&НаКлиенте
Процедура днк_ЗапасыДнкКоэффициентПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Запасы.ТекущиеДанные;
	ВсегоРасходы = Объект.Расходы.Итог("Всего");
	Если ВсегоРасходы <= 0 Тогда
		ТекущаяСтрока.днкКоэффициент = 0;
		Возврат;
	КонецЕсли;
	
	СуммаКоэффициентов = Объект.Запасы.Итог("днкКоэффициент");
	
	
	ТекущаяСтрока.СуммаРасходов = ТекущаяСтрока.днкКоэффициент / 100 * ВсегоРасходы;
	ИтогДнкКоэффициент = Объект.Запасы.Итог("днкКоэффициент");
	
	днк_ПроверитьИтогДнкКоэффициент();
КонецПроцедуры

&НаКлиенте
Процедура днк_ЗапасыСуммаРасходовПриИзмененииПосле(Элемент)
	днк_ПересчитатьДнкКоэффициентСервер();
	днк_ПроверитьИтогДнкКоэффициент();
КонецПроцедуры

&НаКлиенте
Процедура днк_ЗапасыПослеУдаленияПосле(Элемент)
	днк_ПересчитатьДнкКоэффициентСервер();
	днк_ПроверитьИтогДнкКоэффициент();
КонецПроцедуры

&НаСервере
Процедура днк_ОбработкаПроверкиЗаполненияНаСервереПосле(Отказ, ПроверяемыеРеквизиты)
	Если Объект.ВключатьРасходыВСебестоимость И Объект.Запасы.Итог("днкКоэффициент") <> 100 Тогда
		
		ТекстСообщения = НСтр("ru='Сумма % распределения не равна 100%!';uk='Сума % розподілу не дорівнює 100%!'");
		УправлениеНебольшойФирмойСервер.СообщитьОбОшибке(
			,
			ТекстСообщения,
			Неопределено,
			Неопределено,
			Неопределено,
			Отказ
		);
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
&После("РаспределитьТабЧастьРасходыПоКоличеству")
Процедура днк_РаспределитьТабЧастьРасходыПоКоличеству()
	днк_ПересчитатьДнкКоэффициентСервер();
КонецПроцедуры

&НаСервере
&После("РаспределитьТабЧастьРасходыПоСумме")
Процедура днк_РаспределитьТабЧастьРасходыПоСумме()
	днк_ПересчитатьДнкКоэффициентСервер();
КонецПроцедуры

&НаСервере
Процедура днк_ДобавитьДнкКоэффициент()
	//Добавим в форму новые реквизиты
	новыеРеквизиты = Новый Массив;
	
	новыйРеквизит = Новый РеквизитФормы("днкКоэффициент",
		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,12,ДопустимыйЗнак.Неотрицательный)), "Объект.Запасы", "% от Суммы услуг", Ложь);
	новыеРеквизиты.Добавить(новыйРеквизит);
	
	ИзменитьРеквизиты(новыеРеквизиты);
	
	//Добавим в форму новые элементы и свяжем их с новыми реквизитами
	новыйЭлемент = Элементы.Добавить("ЗапасыДнкКоэффициент", Тип("ПолеФормы"), Элементы.Запасы);
	новыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	новыйЭлемент.РежимРедактирования = РежимРедактированияКолонки.ВходПриВводе;
	новыйЭлемент.ОтображатьВПодвале = Истина;
	новыйЭлемент.ПутьКДаннымПодвала = "ИтогДнкКоэффициент";
	новыйЭлемент.ПутьКДанным = "Объект.Запасы.днкКоэффициент";
	//Поставим в нужное место
	Элементы.Переместить(новыйЭлемент, Элементы.Запасы, Элементы.Запасы.ПодчиненныеЭлементы.ЗапасыСуммаРасходов);
	
	//Добавим обработчики событий
	новыйЭлемент.УстановитьДействие("ПриИзменении","днк_ЗапасыДнкКоэффициентПриИзменении");

КонецПроцедуры	

&НаСервере
Процедура днк_УдалитьДнкКоэффициент()
	//Удалим реквизиты
	удаляемыеРеквизиты = Новый Массив;
	
	удаляемыеРеквизиты.Добавить("Объект.Запасы.днкКоэффициент");
	
	ИзменитьРеквизиты(,удаляемыеРеквизиты);
	
	//Удалим соответствующие элементы формы
	ЭтаФорма.Элементы.Удалить(ЭтаФорма.Элементы.ЗапасыДнкКоэффициент);

КонецПроцедуры	

&НаСервере
Процедура днк_ПересчитатьДнкКоэффициентСервер()
	//Заполним проценты
	ВсегоРасходы = Объект.Расходы.Итог("Всего");
	Для Каждого строка Из Объект.Запасы Цикл
		Если ВсегоРасходы <= 0 Тогда 
			строка.днкКоэффициент = 0;
		Иначе 
			строка.днкКоэффициент = строка.СуммаРасходов / ВсегоРасходы * 100;
		КонецЕсли;
	КонецЦикла;
	//Итоги нужно считать программно :(
	ИтогДнкКоэффициент = Объект.Запасы.Итог("днкКоэффициент");
КонецПроцедуры

&НаКлиенте
Процедура днк_ПроверитьИтогДнкКоэффициент()
	ВсегоРасходы = Объект.Расходы.Итог("Всего");
	Элементы.ЗапасыДнкКоэффициент.ЦветФонаПодвала = Новый Цвет();
	Элементы.ЗапасыДнкКоэффициент.ЦветТекстаПодвала = Новый Цвет();
	
	Если ВсегоРасходы <= 0 Тогда Возврат; КонецЕсли;
	
	СуммаКоэффициентов = Объект.Запасы.Итог("днкКоэффициент");
	
	Если СуммаКоэффициентов <> 100 Тогда 
		Элементы.ЗапасыДнкКоэффициент.ЦветФонаПодвала = Новый Цвет(178,34,34);
		Элементы.ЗапасыДнкКоэффициент.ЦветТекстаПодвала = Новый Цвет(255,182,193);
	КонецЕсли;
КонецПроцедуры
